In [3]:
conda update numpy pandas

SyntaxError: invalid syntax (4178309002.py, line 1)

In [2]:
from numpy.random import randn

In [16]:
np.random.seed(101)

In [17]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [18]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [20]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [23]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [24]:
df['new'] = df['W'] + df['Y']

In [25]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [31]:
df.drop('W',axis = 1)

          X         Y         Z       new
A  0.628133  0.907969  0.503826  3.614819
B -0.319318 -0.848077  0.605965 -0.196959
C  0.740122  0.528813 -0.589001 -1.489355
D -0.758872 -0.933237  0.955057 -0.744542
E  1.978757  2.605967  0.683509  2.796762

In [32]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [36]:
df.drop('W',axis = 1,inplace = True)

In [37]:
df

          X         Y         Z       new
A  0.628133  0.907969  0.503826  3.614819
B -0.319318 -0.848077  0.605965 -0.196959
C  0.740122  0.528813 -0.589001 -1.489355
D -0.758872 -0.933237  0.955057 -0.744542
E  1.978757  2.605967  0.683509  2.796762

In [38]:
df.drop('E',axis = 0)

          X         Y         Z       new
A  0.628133  0.907969  0.503826  3.614819
B -0.319318 -0.848077  0.605965 -0.196959
C  0.740122  0.528813 -0.589001 -1.489355
D -0.758872 -0.933237  0.955057 -0.744542

In [39]:
df.shape

(5, 4)

In [41]:
#SELECTING COLUMNS
df[['Z','X']]

          Z         X
A  0.503826  0.628133
B  0.605965 -0.319318
C -0.589001  0.740122
D  0.955057 -0.758872
E  0.683509  1.978757

In [47]:
#SELECTING ROWS(1)
df.loc['A']

X      0.628133
Y      0.907969
Z      0.503826
new    3.614819
Name: A, dtype: float64

In [50]:
#SELECTING ROWS(2)
df.iloc[2]

X      0.740122
Y      0.528813
Z     -0.589001
new   -1.489355
Name: C, dtype: float64

In [52]:
#accessing elements
df.loc['B','Y']

-0.8480769834036315

In [54]:
df

          X         Y         Z       new
A  0.628133  0.907969  0.503826  3.614819
B -0.319318 -0.848077  0.605965 -0.196959
C  0.740122  0.528813 -0.589001 -1.489355
D -0.758872 -0.933237  0.955057 -0.744542
E  1.978757  2.605967  0.683509  2.796762

In [55]:
df.loc[['A','B'],['new','Z']]

        new         Z
A  3.614819  0.503826
B -0.196959  0.605965